Revit 2027 API
Parameter.Set(Int32) Method
Sets the parameter to a new integer value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Set(
	int value
)
Public Function Set (
	value As Integer
) As Boolean
public:
bool Set(
	int value
)
member Set :
        value : int -> bool
Parameters
value Int32
The new integer value to which the parameter is to be set.
Return Value
Boolean
The Set method will return True if the parameter was successfully set to the new value, otherwise false.
Exceptions
Exception | Condition
InvalidOperationException | The parameter is read-only.
Remarks
You should only use this method if the StorageType property reports the type of the parameter as an integer.
See Also
Reference
Parameter Class
Set Overload
Autodesk.Revit.DB Namespace